# CannotMoveBoundaryCondition Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StructuralLoadFailures..::..CannotMoveBoundaryCondition Property
BuiltInFailures..::..StructuralLoadFailures Class See Also
---
Can't move Boundary Conditions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotMoveBoundaryCondition { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotMoveBoundaryCondition As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotMoveBoundaryCondition {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StructuralLoadFailures Class
Autodesk.Revit.DB Namespace